<?php

namespace Faker\Provider\ar_MA;

class Address extends \Faker\Provider\Address
{
    protected static $streetPrefix = ['شارع', 'زنقة', 'ممر'];

    protected static $cityName = [
        'الرباط',
        'الخميسات',
        'تيفلت',
        'الرماني',
        'والماس',
        'بوزنيقة',
        'القنيطرة',
        'سيدي قاسم',
        'سيدي يحيى الغرب',
        'سيدي سليمان',
        'سوق أربعاء الغرب',
        'عرباوة',
        'مولاي بوسلهام',
        'طنجة',
        'تطوان',
        'العرائش',
        'أصيلة',
        'شفشاون',
        'مرتيل',
        'المضيق',
        'القصر الكبير',
        'القصر الصغير',
        'الحسيمة',
        'سبتة',
        'الفنيدق',
        'الجبهة',
        'واد لاو',
        'باب برد',
        'وزان',
        'بوسكور',
        'وجدة',
        'بركان',
        'فكيك',
        'بوعرفة',
        'كرسيف',
        'جرادة',
        'عين الشعير',
        'تاوريرت',
        'الناظور',
        'مليلية',
        'دبدو',
        'سلوان',
        'بني أنصار',
        'فرخانة',
        'تالسينت',
        'تندرارة',
        'العيون الشرقية',
        'بني ادرار',
        'السعيدية',
        'رأس الماء',
        'تافوغالت',
        'فزوان',
        'أحفير',
        'زايو',
        'دريوش',
        'بني تجيت',
        'بوعنان',
        'الدار البيضاء',
        'المحمدية',
        'بن سليمان',
        'سطات',
        'الكارة',
        'البروج',
        'ابن أحمد',
        'برشيد',
        'الجديدة',
        'أزمور',
        'سيدي بنور',
        'خميس الزمامرة',
        'خنيفرة',
        'مولاي بوعزة',
        'زاوية أحنصال',
        'بني ملال',
        'أزيلال',
        'الفقيه بنصالح',
        'دمنات',
        'القصيبة',
        'قصبة تادلة',
        'خريبكة',
        'وادي زم',
        'فاس',
        'صفرو',
        'مولاي يعقوب',
        'بولمان',
        'ميسور',
        'رباط الخير',
        'المنزل بني يازغة',
        'إموزار كندر',
        'تازة',
        'تاونات',
        'أكنول',
        'تيزي وسلي',
        'بورد',
        'تاهلة',
        'تيسة',
        'قرية با محمد',
        'كتامة',
        'واد أمليل',
        'مكناس',
        'يفرن',
        'الحاجب',
        'زرهون',
        'آزرو',
        'مراكش',
        'قلعة السراغنة',
        'الصويرة',
        'شيشاوة',
        'بنجرير',
        'الرحامنة',
        'تمنار',
        'آسفي',
        'الوليدية',
        'اليوسفية',
        'تسلطانت',
        'تامصلوحت',
        'قطارة',
        'أكادير',
        'تارودانت',
        'تزنيت',
        'إغرم',
        'تالوين',
        'تافراوت',
        'طاطا',
        'أقا',
        'فم لحصن',
        'بويكرة',
        'أولاد تايمة',
        'الرشيدية',
        'الريصاني',
        'أرفود',
        'تنديت',
        'كلميمة',
        'إملشيل',
        'تنجداد',
        'الريش',
        'ميدلت',
        'زاكورة',
        'ورزازات',
        'تنغير',
        'هسكورة',
        'قلعة مكونة',
        'أكدز',
        'بومالن دادس',
        'النيف',
        'أسول',
        'أمسمرير',
        'تازارين',
        'سيدي إفني',
        'كلميم',
        'أسا',
        'الزاك',
        'طانطان',
        'بويزكارن',
        'المحبس',
        'لمسيد',
        'العيون',
        'السمارة',
        'بوجدور',
        'طرفاية',
        'تفاريتي',
        'بوكراع',
        'كلتة زمور',
        'أمكالة',
        'أخفنير',
        'الداخلة',
        'الكويرة',
        'أوسرد',
        'بئر كندوز',
        'بئر أنزاران',
        'خميس سيدي عبد الجليل',
        'أولاد عياد',
        'تاهلة',
        'مطماطة',
        'إيمنتانوت',
        'سيدي غانم',
        'تفنتان',
        'آيت القاق',
        'أكدال أملشيل',
        'اكودال املشيل ميدلت',
        'أكايوار',
        'عين العودة',
        'أسكين',
        'آيت ورير',
        'زاوية مولاي ابراهيم',
        'تولكولت',
        'إيكس',
        'كرس',
        'تيسنت',
        'فم زكيد',
        'قصر إيش',
        'إيمين ثلاث',
    ];

    protected static $states = [
        'طنجة-تطوان - الحسيمة',
        'جهة الشرق',
        'فاس - مكناس',
        'الرباط-سلا - القنيطرة',
        'بني ملال - خنيفرة',
        'الدار البيضاء - سطات',
        'مراكش - أسفي',
        'درعة - تافيلالت',
        'سوس - ماسة',
        'كلميم - واد نون',
        'العيون - الساقية الحمراء',
        'الداخلة - وادي الذهب',
    ];



    protected static $buildingNumber = ['%####', '%###', '%#'];

    protected static $postcode = ['#####', '#####-####'];

    /**
     * @see http://www.nationsonline.org/oneworld/countrynames_arabic.htm
     */
    protected static $country = [
        'الكاريبي', 'أمريكا الوسطى', 'أنتيجوا وبربودا', 'أنجولا', 'أنجويلا', 'أندورا', 'اندونيسيا', 'أورجواي', 'أوروبا', 'أوزبكستان', 'أوغندا', 'أوقيانوسيا', 'أوقيانوسيا النائية', 'أوكرانيا', 'ايران', 'أيرلندا', 'أيسلندا', 'ايطاليا',
        'بابوا غينيا الجديدة', 'باراجواي', 'باكستان', 'بالاو', 'بتسوانا', 'بتكايرن', 'بربادوس', 'برمودا', 'بروناي', 'بلجيكا', 'بلغاريا', 'بليز', 'بنجلاديش', 'بنما', 'بنين', 'بوتان', 'بورتوريكو', 'بوركينا فاسو', 'بوروندي', 'بولندا', 'بوليفيا', 'بولينيزيا', 'بولينيزيا الفرنسية', 'بيرو',
        'تانزانيا', 'تايلند', 'تايوان', 'تركمانستان', 'تركيا', 'ترينيداد وتوباغو', 'تشاد', 'توجو', 'توفالو', 'توكيلو', 'تونجا', 'تونس', 'تيمور الشرقية',
        'جامايكا', 'جبل طارق', 'جرينادا', 'جرينلاند', 'جزر الأنتيل الهولندية', 'جزر الترك وجايكوس', 'جزر القمر', 'جزر الكايمن', 'جزر المارشال', 'جزر الملديف', 'جزر الولايات المتحدة البعيدة الصغيرة', 'جزر أولان', 'جزر سليمان', 'جزر فارو', 'جزر فرجين الأمريكية', 'جزر فرجين البريطانية', 'جزر فوكلاند', 'جزر كوك', 'جزر كوكوس', 'جزر ماريانا الشمالية', 'جزر والس وفوتونا', 'جزيرة الكريسماس', 'جزيرة بوفيه', 'جزيرة مان', 'جزيرة نورفوك', 'جزيرة هيرد وماكدونالد', 'جمهورية افريقيا الوسطى', 'جمهورية التشيك', 'جمهورية الدومينيك', 'جمهورية الكونغو الديمقراطية', 'جمهورية جنوب افريقيا', 'جنوب آسيا', 'جنوب أوروبا', 'جنوب شرق آسيا', 'جنوب وسط آسيا', 'جواتيمالا', 'جوادلوب', 'جوام', 'جورجيا', 'جورجيا الجنوبية وجزر ساندويتش الجنوبية', 'جيبوتي', 'جيرسي',
        'دومينيكا',
        'رواندا', 'روسيا', 'روسيا البيضاء', 'رومانيا', 'روينيون',
        'زامبيا', 'زيمبابوي',
        'ساحل العاج', 'ساموا', 'ساموا الأمريكية', 'سانت بيير وميكولون', 'سانت فنسنت وغرنادين', 'سانت كيتس ونيفيس', 'سانت لوسيا', 'سانت مارتين', 'سانت هيلنا', 'سان مارينو', 'ساو تومي وبرينسيبي', 'سريلانكا', 'سفالبارد وجان مايان', 'سلوفاكيا', 'سلوفينيا', 'سنغافورة', 'سوازيلاند', 'سوريا', 'سورينام', 'سويسرا', 'سيراليون', 'سيشل',
        'شرق آسيا', 'شرق افريقيا', 'شرق أوروبا', 'شمال افريقيا', 'شمال أمريكا', 'شمال أوروبا', 'شيلي',
        'صربيا', 'صربيا والجبل الأسود',
        'طاجكستان',
        'عمان',
        'غامبيا', 'غانا', 'غرب آسيا', 'غرب افريقيا', 'غرب أوروبا', 'غويانا', 'غيانا', 'غينيا', 'غينيا الاستوائية', 'غينيا بيساو',
        'فانواتو', 'فرنسا', 'فلسطين', 'فنزويلا', 'فنلندا', 'فيتنام', 'فيجي',
        'قبرص', 'قرغيزستان', 'قطر',
        'كازاخستان', 'كاليدونيا الجديدة', 'كرواتيا', 'كمبوديا', 'كندا', 'كوبا', 'كوريا الجنوبية', 'كوريا الشمالية', 'كوستاريكا', 'كولومبيا', 'كومنولث الدول المستقلة', 'كيريباتي', 'كينيا',
        'لاتفيا', 'لاوس', 'لبنان', 'لوكسمبورج', 'ليبيا', 'ليبيريا', 'ليتوانيا', 'ليختنشتاين', 'ليسوتو',
        'مارتينيك', 'ماكاو الصينية', 'مالطا', 'مالي', 'ماليزيا', 'مايوت', 'مدغشقر', 'مصر', 'مقدونيا', 'ملاوي', 'منغوليا', 'موريتانيا', 'موريشيوس', 'موزمبيق', 'مولدافيا', 'موناكو', 'مونتسرات', 'ميانمار', 'ميكرونيزيا', 'ميلانيزيا',
        'ناميبيا', 'نورو', 'نيبال', 'نيجيريا', 'نيكاراجوا', 'نيوزيلاندا', 'نيوي',
        'هايتي', 'هندوراس', 'هولندا', 'هونج كونج الصينية',
        'وسط آسيا', 'وسط افريقيا',
    ];

    protected static $cityFormats = [
        '{{cityName}}',
    ];

    protected static $streetNameFormats = [
        '{{streetPrefix}} {{firstName}} {{lastName}}',
    ];

    protected static $streetAddressFormats = [
        '{{buildingNumber}} {{streetName}}',
        '{{buildingNumber}} {{streetName}} {{secondaryAddress}}',
    ];

    protected static $addressFormats = [
        "{{streetAddress}}\n{{city}}",
    ];

    protected static $secondaryAddressFormats = ['شقة رقم. ##', 'عمارة رقم ##'];

    /**
     * @example 'شرق'
     */
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }

    /**
     * @example 'بركان'
     */
    public static function cityName()
    {
        return static::randomElement(static::$cityName);
    }

    /**
     * @example 'شارع'
     */
    public static function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }

    /**
     * @example 'شقة رقم. 350'
     */
    public static function secondaryAddress()
    {
        return static::numerify(static::randomElement(static::$secondaryAddressFormats));
    }

    /**
     * @example 'جهة الشرق'
     */
    public static function state()
    {
        return static::randomElement(static::$states);
    }

}
